app/Models/loginModel.php

    public function obtenerUsuario($data){
        $Usuario = $this->db->table('usuarios');
        $Usuario->where('email_usuario',$data);
        return $Usuario->get()->getResultArray();
---
SELECT *
FROM `usuarios`
WHERE `email_usuario` = ('alan@gmail.com')